erp3l/src/DataProcessors/ПанельАдминистрированияУХ/ПанельАдминистрированияУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельАдминистрированияУХ</name>
</mdclass:DataProcessor>

erp3l/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)(-УХМодульМенеджера)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>ДевятьМесяцев</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/ВидыСобытийОповещений/ВидыСобытийОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыСобытийОповещений</name>
  <predefined>
    <items>
      <name>ВключениеВРеестр</name>
      <description>Включение в реестр платежей</description>
    </items>
    <items>
      <name>ИсключениеИзСтопЛиста</name>
      <description>Возврат из списка отложенных</description>
    </items>
    <items>
      <name>ВозниклаОшибкаПриЗапускеПроцесса</name>
      <description>Возникла ошибка при запуске процесса</description>
    </items>
    <items>
      <name>ВыполнениеОперацииПоМероприятию</name>
      <description>Выполнение операции по мероприятию</description>
    </items>
    <items>
      <name>ВыполнениеОперацииПоСтадииМероприятия</name>
      <description>Выполнение операции по стадии мероприятия</description>
    </items>
    <items>
      <name>ВыходЗаГраницыПоказателей</name>
      <description>Выход за границы показателей</description>
    </items>
    <items>
      <name>ДобавленДополнительныйСогласующий</name>
      <description>Добавлен дополнительный согласующий</description>
    </items>
    <items>
      <name>ДобавленЗаместитель</name>
      <description>Добавлен заместитель</description>
    </items>
    <items>
      <name>ДоговорОтправленНаУточнение</name>
      <description>Договор отправлен на уточнение</description>
    </items>
    <items>
      <name>ДоговорПереданНаПодписьКонтрагенту</name>
      <description>Договор передан на подпись контрагенту</description>
    </items>
    <items>
      <name>ДоговорПереданПодписанту</name>
      <description>Договор передан подписанту</description>
    </items>
    <items>
      <name>ДоговорПодписан</name>
      <description>Договор подписан</description>
    </items>
    <items>
      <name>ДоговорПриостановлен</name>
      <description>Договор приостановлен</description>
    </items>
    <items>
      <name>ДоговорРасторгнут</name>
      <description>Договор расторгнут</description>
    </items>
    <items>
      <name>ЗапросНалоговогоМониторинга</name>
      <description>Запрос налогового мониторинга</description>
    </items>
    <items>
      <name>ИзменениеСостоянияОбъекта</name>
      <description>Измененение состояния объекта</description>
    </items>
    <items>
      <name>ИсключениеИзРеестра</name>
      <description>Исключение из реестра платежей</description>
    </items>
    <items>
      <name>КорректировкаРазмещения</name>
      <description>Корректировка размещения</description>
    </items>
    <items>
      <name>НапоминаниеОНеобходимостиИзмененияСтатусаПретензии</name>
      <description>Напоминание о необходимости изменения статуса претензии</description>
    </items>
    <items>
      <name>НапоминаниеСогласованиеЭтапа</name>
      <description>Напоминание о необходимости согласовать этап</description>
    </items>
    <items>
      <name>Напоминание_СоздатьСВО</name>
      <description>Напоминание о необходимости создать Справку о валютных операциях</description>
    </items>
    <items>
      <name>Напоминание_СоздатьСПД</name>
      <description>Напоминание о необходимости создать Справку о подтверждающих документах</description>
    </items>
    <items>
      <name>Напоминание_СтадияМероприятия</name>
      <description>Напоминание о приближении стадии мероприятия</description>
    </items>
    <items>
      <name>Напоминание_ПроверитьОжидаемыеСрокиСВО</name>
      <description>Напоминание проверить ожидаемые сроки СВО</description>
    </items>
    <items>
      <name>Напоминание_ПроверитьОжидаемыеСрокиСПД</name>
      <description>Напоминание проверить ожидаемые сроки СПД</description>
    </items>
    <items>
      <name>НарушениеИсполненияОбязательствКонтрагентомПоДоговору</name>
      <description>Нарушение исполнения обязательств контрагентом по договору</description>
    </items>
    <items>
      <name>НарушениеИсполненияОбязательствОрганизациейПоДоговору</name>
      <description>Нарушение исполнения обязательств организацией по договору</description>
    </items>
    <items>
      <name>Напоминание_НачалоПодготовкиЗакупки</name>
      <description>Начало подготовки закупки</description>
    </items>
    <items>
      <name>ОбъектНаУтверждении</name>
      <description>Начато согласование объекта</description>
    </items>
    <items>
      <name>ОбработкаВыполнена</name>
      <description>Обработка выполнена</description>
    </items>
    <items>
      <name>ОбъектОтклонен</name>
      <description>Объект отклонен</description>
    </items>
    <items>
      <name>ОбъектУтвержден</name>
      <description>Объект утвержден</description>
    </items>
    <items>
      <name>Оплата</name>
      <description>Оплата</description>
    </items>
    <items>
      <name>Напоминание_ОплатаПоГрафикуДоговора</name>
      <description>Оплата по графику договора</description>
    </items>
    <items>
      <name>ОповещениеОВозможностиУчаствоватьВЛотеАккредитованномуВнешнемуПоставщику</name>
      <description>Оповещение о возможности участвовать в лоте аккредитованному внешнему поставщику</description>
    </items>
    <items>
      <name>ОповещениеОВозможностиУчаствоватьВЛотеВнешнемуПоставщику</name>
      <description>Оповещение о возможности участвовать в лоте не аккредитованному внешнему поставщику</description>
    </items>
    <items>
      <name>ОповещениеОбОтправкеНаИсправлениеАккредитации</name>
      <description>Оповещение о необходимости исправить документ &quot;Аккредитация поставщика&quot;</description>
    </items>
    <items>
      <name>ОповещениеОбОтправкеНаИсправлениеКвалификации</name>
      <description>Оповещение о необходимости исправить документ &quot;Квалификация поставщика&quot;</description>
    </items>
    <items>
      <name>ОповещениеОНеутвержденииАккредитации</name>
      <description>Оповещение об отказе в утверждении документа &quot;Аккредитация поставщика&quot;</description>
    </items>
    <items>
      <name>ОповещениеОНеутвержденииКвалификации</name>
      <description>Оповещение об отказе в утверждении документа &quot;Квалификация поставщика&quot;</description>
    </items>
    <items>
      <name>ОповещениеОбОтказеВДоступеВнешнемуПоставщику</name>
      <description>Оповещение об отказе доступа внешнему поставщику</description>
    </items>
    <items>
      <name>ОповещениеОбОткрытииДоступаВнешнемуПоставщику</name>
      <description>Оповещение об открытии доступа внешнему поставщику</description>
    </items>
    <items>
      <name>ОповещениеОбОтменеАккредитации</name>
      <description>Оповещение об отмене аккредитации документом &quot;Отмена аккредитации&quot;</description>
    </items>
    <items>
      <name>ОповещениеОбУтвержденииАккредитации</name>
      <description>Оповещение об утверждении документа &quot;Аккредитация поставщика&quot;</description>
    </items>
    <items>
      <name>ОповещениеОбУтвержденииКвалификации</name>
      <description>Оповещение об утверждении документа &quot;Квалификация поставщика&quot;</description>
    </items>
    <items>
      <name>ОповещенияЭтапаПроцесса</name>
      <description>Оповещение по этапу &quot;Оповещение&quot;</description>
    </items>
    <items>
      <name>ОповещениеОЛишенииАккредитации</name>
      <description>Оповещение поставщика о лишении аккредитации</description>
    </items>
    <items>
      <name>ОповещениеОЗапретеАккредитацииДоДаты</name>
      <description>Оповещение поставщика о лишении аккредитации и запрете повторной аккредитации на определенный срок</description>
    </items>
    <items>
      <name>ОшибкаПриЗапускеПроцесса</name>
      <description>Отключено регл. задание обработки этапов</description>
    </items>
    <items>
      <name>ОтменаДокументаОбеспеченногоКорректировкойЛимитов</name>
      <description>Отмена документа, обеспеченного корректировкой лимитов</description>
    </items>
    <items>
      <name>Напоминание_ОфициальноеОбъявлениеЗакупки</name>
      <description>Официальное объявление закупки</description>
    </items>
    <items>
      <name>ОшибкаОбработкиСогласованияПоЭлектроннойПочте</name>
      <description>Ошибка обработки согласования по электронной почте</description>
    </items>
    <items>
      <name>ОшибкаУсловногоПерехода</name>
      <description>Ошибка перехода по условию</description>
    </items>
    <items>
      <name>ОшибкаРолевойАдресации</name>
      <description>Ошибка ролевой адресации</description>
    </items>
    <items>
      <name>ОшибкаЭтапаОбработка</name>
      <description>Ошибка этапа обработка</description>
    </items>
    <items>
      <name>ПередачаВОплату</name>
      <description>Передача в оплату</description>
    </items>
    <items>
      <name>ПлатежНеИсполненВСрок</name>
      <description>Платеж не исполнен в срок</description>
    </items>
    <items>
      <name>ПоДоговоруНаправленЗаказПоставщику</name>
      <description>По договору направлен заказ поставщику</description>
    </items>
    <items>
      <name>ПомещениеВСтопЛист</name>
      <description>Помещение в список отложенных</description>
    </items>
    <items>
      <name>ПредписаниеИсполнителю</name>
      <description>Предписание исполнителю</description>
    </items>
    <items>
      <name>НапоминаниеПриближаетсяСрокОплаты</name>
      <description>Приближается срок оплаты</description>
    </items>
    <items>
      <name>ПроверкаИсполненияПоручения</name>
      <description>Проверка исполнения поручения</description>
    </items>
    <items>
      <name>ПроверкаСтатусовКовенантов</name>
      <description>Проверка статусов ковенантов</description>
    </items>
    <items>
      <name>ПроектВключенВПрограмму</name>
      <description>Проект включен в программу</description>
    </items>
    <items>
      <name>ПроектЗавершен</name>
      <description>Проект завершен</description>
    </items>
    <items>
      <name>ПроектПриостановлен</name>
      <description>Проект приостановлен</description>
    </items>
    <items>
      <name>ПросрочкаПроверкиСтатусовКовенантов</name>
      <description>Просрочка проверки статусов ковенантов</description>
    </items>
    <items>
      <name>ПроцессЗавершен</name>
      <description>Процесс завершен</description>
    </items>
    <items>
      <name>ПроцессЗапущен</name>
      <description>Процесс запущен</description>
    </items>
    <items>
      <name>ПроцессОстановлен</name>
      <description>Процесс остановлен</description>
    </items>
    <items>
      <name>СогласованиеОбъектаОтменено</name>
      <description>Согласование объекта отменено</description>
    </items>
    <items>
      <name>СогласованиеОтмененоИнициатором</name>
      <description>Согласование отменено инициатором</description>
    </items>
    <items>
      <name>СформированаПретензия</name>
      <description>Сформирована претензия</description>
    </items>
    <items>
      <name>ТребуетсяВыборЭтапа</name>
      <description>Требуется выбор этапа</description>
    </items>
    <items>
      <name>ТребуетсяЗаполнитьОтчетыПоЭтапу</name>
      <description>Требуется заполнить отчеты по этапу</description>
    </items>
    <items>
      <name>ТребуетсяОбработка</name>
      <description>Требуется обработка</description>
    </items>
    <items>
      <name>ТребуетсяСогласование</name>
      <description>Требуется согласование по этапу</description>
    </items>
    <items>
      <name>УдаленДополнительныйСогласующий</name>
      <description>Удалён дополнительный согласующий</description>
    </items>
    <items>
      <name>УдаленЗаместитель</name>
      <description>Удалён заместитель</description>
    </items>
    <items>
      <name>ЭтапОтклонен</name>
      <description>Этап отклонен</description>
    </items>
    <items>
      <name>ЭтапПроцессаПереведенВСтатусВыполняется</name>
      <description>Этап процесса по организации переведен в статус &quot;выполняется&quot;</description>
    </items>
    <items>
      <name>ЭтапПроцессаПереведенВСтатусУтвержден</name>
      <description>Этап процесса по организации переведен в статус &quot;утвержден&quot;</description>
    </items>
    <items>
      <name>ЭтапСогласован</name>
      <description>Этап согласован</description>
    </items>
  </predefined>
  <attributes>
    <name>КатегорияСобытия</name>
    <type>
      <types>CatalogRef.КатегорииСобытийОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/DataProcessors/ПанельАдминистрированияУХ/Forms/ЦентрализованныеЗакупки/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ОбновитьИнтерфейс;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаИспользоватьХарактеристикиНоменклатуры.Видимость = 
		НЕ ОбщегоНазначения.ПодсистемаСуществует("ПереопределяемыеОбъектыУП");//ЭтоУХ()
	Элементы.ПериодичностьЦентрализованныхЗакупок.СписокВыбора.ЗагрузитьЗначения(
		ПолучитьМассивПериодовЗакупок(НаборКонстант.ПериодичностьБюджетирования));
	Элементы.НастроитьВидыОперацийПоступленияПоВидамНоменклатуры.Видимость = 
		НЕ ОбщегоНазначения.ПодсистемаСуществует("ПереопределяемыеОбъектыУП");//ЭтоУХ()
	УстановитьОформлениеЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.РазрешитьДоступВнешнихПоставщиков Тогда
		Результат = АккредитацияПоставщиковУХ.ПолучитьСаморегистрациюПоставщика();
		Если НЕ Результат.Успех Тогда
			ВызватьИсключение Результат.ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьОформлениеЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьИнтерфейс();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура ОбработатьПриИзмененииБезОбновленияИнтерфейса(Элемент)
	// Запретим выбирать периодичности, отличные от Месяца.
	ПериодичностьМесяц = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц");
	Если НаборКонстант.ПериодичностьЦентрализованныхЗакупок <> ПериодичностьМесяц Тогда
		ТекстСообщения = НСтр("ru = 'В текущем релизе конфигурации поддерживается только месячная периодичность годового плана'");
		НаборКонстант.ПериодичностьЦентрализованныхЗакупок = ПериодичностьМесяц;
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	Иначе
		// Проверка пройдена.
	КонецЕсли;
	ПриИзмененииРеквизитаСервер(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПриИзмененииИспользоватьЦентрализованноеУправлениеЗакупками(Элемент)
	ОбработатьПриИзмененииСОбновлениемИнтерфейса(Элемент);
	УстановитьЗначенияПоУмолчанию();
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьПриИзмененииСОбновлениемИнтерфейса(Элемент)
	ОбработатьПриИзмененииБезОбновленияИнтерфейса(Элемент);
	ОбновитьИнтерфейс = Истина;
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьДоступВнешнихПоставщиковПриИзменении(Элемент)
	Если НаборКонстант.РазрешитьДоступВнешнихПоставщиков Тогда
		ТекстВопроса =
			НСтр("ru = 'Разрешить доступ внешним пользователям?
			           |
			           |При входе в программу список выбора пользователей станет пустым
			           |(реквизит ""Показывать в списке выбора"" в карточках всех
			           | пользователей будет очищен и скрыт).'");
		ПоказатьВопрос(
			Новый ОписаниеОповещения(
				"РазрешитьДоступВнешнихПоставщиковПриИзмененииЗавершение",
				ЭтотОбъект,
				Элемент),
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ТекстВопроса =
			НСтр("ru = 'Запретить доступ внешним пользователям?
			           |
			           |Реквизит ""Вход в программу разрешен"" будет
			           |очищен в карточках всех внешних пользователей.'");
		ПоказатьВопрос(
			Новый ОписаниеОповещения(
				"РазрешитьДоступВнешнихПоставщиковПриИзмененииЗавершение",
				ЭтотОбъект,
				Элемент),
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РазделятьНоменклатуруПоКатегорийнымМенеджерамПриИзменении(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"РазделятьНоменклатуруПоКатегорийнымМенеджерамПриИзмененииЗавершение",
		ЭтотОбъект,	Элемент);
	
	Если НаборКонстант.РазделятьНоменклатуруПоКатегорийнымМенеджерам Тогда
		ТекстВопроса =
			НСтр("ru = 'Разрешить разделение номенклатуры по товарным категориям?
			           |
			           |В обработке ""Формирование СПЗ"" будут отображаться только потребности, 
			           |соответствующие категорийной матрице пользователя.'");
	Иначе
		ТекстВопроса =
			НСтр("ru = 'Запретить разделение номенклатуры по товарным категориям?
			           |
			           |В обработке ""Формирование СПЗ"" будут отображаться все потребности.'");
	КонецЕсли;
		
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьХарактеристикиНоменклатурыПриИзменении(Элемент)
	ПриИзмененииРеквизитаСервер(Элемент.Имя);
	УстановитьОформлениеЭлементовФормы();
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПроцентГодовогоОбъемаЗакупокТолькоСубъектыМСППриИзменении(Элемент)
	ПриИзмененииРеквизитаСервер(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПроцентГодовогоОбъемаЗакупокСУчастиемСубъектовМСППриИзменении(Элемент)
	ПриИзмененииРеквизитаСервер(Элемент.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ОткрытьНоменклатуруСОсобымПорядкомЗакупки(Команда)
	
	Если УровеньКонтроляПравилНоменклатурыИзменен(НаборКонстант.УровеньКонтроляПравилНоменклатуры) Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Для выполнения действия необходимо предварительно записать текущую форму!'"));
		Возврат;		
	
	КонецЕсли; 
	
	ОткрытьФорму("РегистрСведений.НоменклатураСОсобымПорядкомЗакупки.ФормаСписка",, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидыОперацийПоступленияПоВидамНоменклатуры(Команда)
	ПутьКФорме = 
		"РегистрСведений.ВидыОперацийПоступленияПоВидамНоменклатуры.ФормаСписка";
	ОткрытьФорму(
		ПутьКФорме,
		,
		ЭтаФорма,
		ЭтаФорма.УникальныйИдентификатор,
		,
		,
		,
		РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
	
&НаКлиенте
Процедура НастроитьПараметрыПланированияЗакупочныхПроцедур(Команда)
	ПутьКФорме = 
		"РегистрСведений.НастройкиПланированияЗакупочныхПроцедур.ФормаСписка";
	ОткрытьФорму(
		ПутьКФорме,
		,
		ЭтаФорма,
		ЭтаФорма.УникальныйИдентификатор,
		,
		,
		,
		РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокПравилЗакупки(Команда)
	ОткрытьФорму("Справочник.ПоложениеОЗакупках.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНазначениеПравилЗакупкиОрганизациям(Команда)
	ОткрытьФорму("РегистрСведений.ДействиеПоложенийОЗакупках.Форма.ФормаСпискаПоГодам");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВнешниеСистемы(Команда)
	ОткрытьФорму("Справочник.ЭлектронныеТорговыеПлощадки.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКодыПротоколовЗакупокНаЕИС(Команда)
	ОткрытьФорму("Справочник.ТипыПротоколовЗакупокЕИС.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКодыЗакупокВЕис(Команда)
	ОткрытьФорму("РегистрСведений.НомераСпособовЗакупокВЕИС.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКатегорииЗакупокДляИсключенияИзГОЗ(Команда)
	ОткрытьФорму("Справочник.КатегорииЗакупокДляИсключенияИзГОЗ.ФормаСписка");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеЭлементовФормы()
	флИспользоватьЦУЗ = 
		НаборКонстант.ИспользоватьЦентрализованноеУправлениеЗакупками;
	Элементы.ГруппаЦентрализованныеЗакупкиНастройки.Доступность =
		флИспользоватьЦУЗ;
	Элементы.ОткрытьКатегорийнуюМатрицу.Доступность = НаборКонстант.РазделятьНоменклатуруПоКатегорийнымМенеджерам;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	Если НаборКонстант.ИспользоватьЦентрализованноеУправлениеЗакупками = Истина
		И Константы.ПериодичностьЦентрализованныхЗакупок.Получить() = Перечисления.Периодичность.ПустаяСсылка() Тогда
		Константы.ПериодичностьЦентрализованныхЗакупок.Установить(Перечисления.Периодичность.Месяц);
	КонецЕсли;	
	Если НаборКонстант.ИспользоватьЦентрализованноеУправлениеЗакупками = Истина
		И Константы.ПроцентГодовогоОбъемаЗакупокТолькоСубъектыМСП.Получить() = 0 Тогда
		Константы.ПроцентГодовогоОбъемаЗакупокТолькоСубъектыМСП.Установить(18);
	КонецЕсли;	
	Если НаборКонстант.ИспользоватьЦентрализованноеУправлениеЗакупками = Истина
		И Константы.ПроцентГодовогоОбъемаЗакупокСУчастиемСубъектовМСП.Получить() = 0 Тогда
		Константы.ПроцентГодовогоОбъемаЗакупокСУчастиемСубъектовМСП.Установить(20);
	КонецЕсли;	
	НаборКонстант.ПроцентГодовогоОбъемаЗакупокСУчастиемСубъектовМСП = Константы.ПроцентГодовогоОбъемаЗакупокСУчастиемСубъектовМСП.Получить();
	НаборКонстант.ПроцентГодовогоОбъемаЗакупокТолькоСубъектыМСП = Константы.ПроцентГодовогоОбъемаЗакупокТолькоСубъектыМСП.Получить();
	
КонецПроцедуры	

&НаКлиенте
Процедура РазрешитьДоступВнешнихПоставщиковПриИзмененииЗавершение(
												Ответ, Элемент) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		НаборКонстант.РазрешитьДоступВнешнихПоставщиков =
			Не НаборКонстант.РазрешитьДоступВнешнихПоставщиков;
	КонецЕсли;
	НаборКонстант.ИспользоватьВнешнихПользователей =
		НаборКонстант.РазрешитьДоступВнешнихПоставщиков;
	ОбработатьПриИзмененииБезОбновленияИнтерфейса(
		Элементы.РазрешитьДоступВнешнихПоставщиков);
	ОбработатьПриИзмененииБезОбновленияИнтерфейса(
		Элементы.ИспользоватьВнешнихПользователей);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивПериодовЗакупок(ПериодБюджетирования)
	мПериоды = Новый Массив;
	мПериоды.Добавить(Перечисления.Периодичность.Неделя);
	мПериоды.Добавить(Перечисления.Периодичность.Декада);
	мПериоды.Добавить(Перечисления.Периодичность.Месяц);
	мПериоды.Добавить(Перечисления.Периодичность.Квартал);
	мПериоды.Добавить(Перечисления.Периодичность.Полугодие);
	мПериоды.Добавить(Перечисления.Периодичность.ДевятьМесяцев);
	мПериоды.Добавить(Перечисления.Периодичность.Год);
	
	Если ЗначениеЗаполнено(ПериодБюджетирования) Тогда
		Ном = мПериоды.Найти(ПериодБюджетирования);
		Если Ном <> Неопределено Тогда
			УдаляемыйНомер = 6;
			Пока УдаляемыйНомер > Ном Цикл
				мПериоды.Удалить(УдаляемыйНомер);
				УдаляемыйНомер = УдаляемыйНомер - 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат мПериоды;
КонецФункции

&НаСервереБезКонтекста
Функция УровеньКонтроляПравилНоменклатурыИзменен(ТекущийУровень)
	
	Возврат Константы.УровеньКонтроляПравилНоменклатуры.Получить() <> ТекущийУровень;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьНастройкиОповещенияПоЗакупкам(Команда)
	СтруктураПараметров = Новый Структура;
	СписокСобытий = Новый СписокЗначений;
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.Напоминание_СтадияМероприятия"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ВыполнениеОперацииПоСтадииМероприятия"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.Напоминание_ОфициальноеОбъявлениеЗакупки"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.Напоминание_НачалоПодготовкиЗакупки"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ОповещениеОВозможностиУчаствоватьВЛотеАккредитованномуВнешнемуПоставщику"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ОповещениеОВозможностиУчаствоватьВЛотеВнешнемуПоставщику"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ОповещениеОбОтправкеНаИсправлениеАккредитации"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ОповещениеОбОтправкеНаИсправлениеКвалификации"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ОповещениеОНеутвержденииАккредитации"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ОповещениеОНеутвержденииКвалификации"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ОповещениеОбОтказеВДоступеВнешнемуПоставщику"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ОповещениеОбОткрытииДоступаВнешнемуПоставщику"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ОповещениеОбОтменеАккредитации"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ОповещениеОбУтвержденииАккредитации"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ОповещениеОбУтвержденииКвалификации"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ОповещениеОЛишенииАккредитации"));
	СписокСобытий.Добавить(ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ОповещениеОЗапретеАккредитацииДоДаты"));
	СтруктураПараметров.Вставить("ОтборСобытий", СписокСобытий);
	ОткрытьФорму("РегистрСведений.НастройкиОповещений.Форма.ПомощникНастройкиОповещений", СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура РазделятьНоменклатуруПоКатегорийнымМенеджерамПриИзмененииЗавершение(Ответ, Элемент) Экспорт
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		НаборКонстант.РазделятьНоменклатуруПоКатегорийнымМенеджерам =
			Не НаборКонстант.РазделятьНоменклатуруПоКатегорийнымМенеджерам;
	КонецЕсли;
	ОбработатьПриИзмененииСОбновлениемИнтерфейса(Элемент);
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	УстановитьОформлениеЭлементовФормы();
	ОбновитьПовторноИспользуемыеЗначения();
	Возврат КонстантаИмя;
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
		Если КонстантаИмя <> "" Тогда
			КонстантаМенеджер = Константы[КонстантаИмя];
			КонстантаЗначение = НаборКонстант[КонстантаИмя];
			Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
				КонстантаМенеджер.Установить(КонстантаЗначение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат КонстантаИмя;
КонецФункции

&НаКлиенте
Процедура УчетНоменклатурыПоставщикаПриИзменении(Элемент)
	ПриИзмененииРеквизитаСервер(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура НеТребоватьРегистрацииУчастниковДляОткрытыхСпособовЗакупокПриИзменении(Элемент)
	ПриИзмененииРеквизитаСервер(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ВестиУчетПоСтранамКорпоративныеЗакупкиПриИзменении(Элемент)
	ПриИзмененииРеквизитаСервер(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура МинимальнаяДоляЗакупок(Команда)
	ОткрытьФорму("РегистрСведений.ДоляЗакупокТоваровРоссийскогоПроисхождения.ФормаСписка");
КонецПроцедуры

#КонецОбласти
